Revit 2027 API
ExternalDataManagerDataItem.Size Property
 The file size (Bytes) of the data item if applicable.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int Size { get; set; }
Public Property Size As Integer
	Get
	Set
public:
property int Size {
	int get ();
	void set (int value);
}
member Size : int with get, set
Property Value
Int32
Remarks
 The default value is -1, means this property is nonsense.
See Also
Reference
ExternalDataManagerDataItem Class
Autodesk.Revit.UI Namespace